# Views

In [29]:
import sqlalchemy as sa
engine = sa.create_engine('postgresql://postgres:pakistan123@localhost:5432/myinfo')
%load_ext sql
%sql $engine.url

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [30]:
# Creating view name info_ 
%sql CREATE VIEW info_ AS SELECT * FROM employees WHERE sex='M';

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]

In [31]:
# show all data in view info_
%sql SELECT * FROM info_;

 * postgresql://postgres:***@localhost:5432/myinfo
5 rows affected.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1005    ', 'Ahmed', 'Hussain', '123410   ', datetime.date(1981, 1, 4), 'M', '216 Oak Tree, Geneva,IL', '500      ', Decimal('70000.00'), '30001    ', '2        '),
 ('E1008    ', 'Bharath', 'Gupta', '123413   ', datetime.date(1985, 5, 6), 'M', '145 Berry Ln, Naperville,IL', '660      ', Decimal('65000.00'), '30003    ', '7        ')]

In [32]:
# here droping view
%sql DROP VIEW info_;

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]

In [33]:
# creating view name info_3 just having emp_id
%sql CREATE VIEW info_3 AS SELECT emp_id FROM employees WHERE sex='M' AND salary > 60000;

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]

In [34]:
%sql SELECT * FROM info_3;

 * postgresql://postgres:***@localhost:5432/myinfo
3 rows affected.

[('E1001    ',), ('E1005    ',), ('E1008    ',)]

In [35]:
#updating view by using replace
%sql CREATE OR REPLACE VIEW info_3 AS SELECT emp_id, salary FROM employees WHERE sex='M' AND salary > 60000;

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]

In [36]:
# getting data
%sql SELECT * FROM info_3;

 * postgresql://postgres:***@localhost:5432/myinfo
3 rows affected.

[('E1001    ', Decimal('100000.00')),
 ('E1005    ', Decimal('70000.00')),
 ('E1008    ', Decimal('65000.00'))]

In [37]:
# droping view 
%sql DROP VIEW info_3;

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]

In [40]:
# creating view form two tables like employees and jobs
%sql CREATE VIEW empsalary_1  AS SELECT emp_id, f_name, l_name, SEX, job_title, min_salary, max_salary FROM employees, jobs WHERE employees.job_id = jobs.job_ident;

 * postgresql://postgres:***@localhost:5432/myinfo
(psycopg2.errors.DuplicateTable) relation "empsalary_1" already exists

[SQL: CREATE VIEW empsalary_1 AS SELECT emp_id, f_name, l_name, SEX, job_title, min_salary, max_salary FROM employees, jobs WHERE employees.job_id = jobs.job_ident;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [42]:
# getting data
%sql SELECT * FROM empsalary_1;

 * postgresql://postgres:***@localhost:5432/myinfo
10 rows affected.

[('E1001    ', 'John', 'Thomas', 'M', 'Sr. Architect', Decimal('60000.00'), Decimal('100000.00')),
 ('E1002    ', 'Alice', 'James', 'F', 'Sr.Software Developer', Decimal('60000.00'), Decimal('80000.00')),
 ('E1003    ', 'Steve', 'Wells', 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1004    ', 'Santosh', 'Kumar', 'M', 'Jr.Software Developer', Decimal('40000.00'), Decimal('60000.00')),
 ('E1005    ', 'Ahmed', 'Hussain', 'M', 'Jr. Architect', Decimal('50000.00'), Decimal('70000.00')),
 ('E1006    ', 'Nancy', 'Allen', 'F', 'Lead Architect', Decimal('70000.00'), Decimal('100000.00')),
 ('E1007    ', 'Mary', 'Thomas', 'F', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1008    ', 'Bharath', 'Gupta', 'M', 'Jr. Designer', Decimal('60000.00'), Decimal('70000.00')),
 ('E1009    ', 'Andrea', 'Jones', 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00')),
 ('E1010    ', 'Ann', 'Jacob', 'F', 'Sr. Designer', Decimal('70000.00'), Decimal('90000.00'))]

In [43]:
#droping view 
%sql DROP VIEW empsalary_1;

 * postgresql://postgres:***@localhost:5432/myinfo
Done.

[]